{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.21.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Generator", "config": {"trainable": true, "dtype": "float32"}}}, "weightsManifest": [{"paths": ["group1-shard1of52.bin", "group1-shard2of52.bin", "group1-shard3of52.bin", "group1-shard4of52.bin", "group1-shard5of52.bin", "group1-shard6of52.bin", "group1-shard7of52.bin", "group1-shard8of52.bin", "group1-shard9of52.bin", "group1-shard10of52.bin", "group1-shard11of52.bin", "group1-shard12of52.bin", "group1-shard13of52.bin", "group1-shard14of52.bin", "group1-shard15of52.bin", "group1-shard16of52.bin", "group1-shard17of52.bin", "group1-shard18of52.bin", "group1-shard19of52.bin", "group1-shard20of52.bin", "group1-shard21of52.bin", "group1-shard22of52.bin", "group1-shard23of52.bin", "group1-shard24of52.bin", "group1-shard25of52.bin", "group1-shard26of52.bin", "group1-shard27of52.bin", "group1-shard28of52.bin", "group1-shard29of52.bin", "group1-shard30of52.bin", "group1-shard31of52.bin", "group1-shard32of52.bin", "group1-shard33of52.bin", "group1-shard34of52.bin", "group1-shard35of52.bin", "group1-shard36of52.bin", "group1-shard37of52.bin", "group1-shard38of52.bin", "group1-shard39of52.bin", "group1-shard40of52.bin", "group1-shard41of52.bin", "group1-shard42of52.bin", "group1-shard43of52.bin", "group1-shard44of52.bin", "group1-shard45of52.bin", "group1-shard46of52.bin", "group1-shard47of52.bin", "group1-shard48of52.bin", "group1-shard49of52.bin", "group1-shard50of52.bin", "group1-shard51of52.bin", "group1-shard52of52.bin"], "weights": [{"name": "generator/decoder/up_sample/sequential_8/conv2d_transpose/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "generator/decoder/up_sample/sequential_8/batch_normalization_7/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample/sequential_8/batch_normalization_7/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_1/sequential_9/conv2d_transpose_1/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "generator/decoder/up_sample_1/sequential_9/batch_normalization_8/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_1/sequential_9/batch_normalization_8/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_2/sequential_10/conv2d_transpose_2/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "generator/decoder/up_sample_2/sequential_10/batch_normalization_9/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_2/sequential_10/batch_normalization_9/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_3/sequential_11/conv2d_transpose_3/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "generator/decoder/up_sample_3/sequential_11/batch_normalization_10/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_3/sequential_11/batch_normalization_10/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_4/sequential_12/conv2d_transpose_4/kernel", "shape": [4, 4, 256, 1024], "dtype": "float32"}, {"name": "generator/decoder/up_sample_4/sequential_12/batch_normalization_11/gamma", "shape": [256], "dtype": "float32"}, {"name": "generator/decoder/up_sample_4/sequential_12/batch_normalization_11/beta", "shape": [256], "dtype": "float32"}, {"name": "generator/decoder/up_sample_5/sequential_13/conv2d_transpose_5/kernel", "shape": [4, 4, 128, 512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_5/sequential_13/batch_normalization_12/gamma", "shape": [128], "dtype": "float32"}, {"name": "generator/decoder/up_sample_5/sequential_13/batch_normalization_12/beta", "shape": [128], "dtype": "float32"}, {"name": "generator/decoder/up_sample_6/sequential_14/conv2d_transpose_6/kernel", "shape": [4, 4, 64, 256], "dtype": "float32"}, {"name": "generator/decoder/up_sample_6/sequential_14/batch_normalization_13/gamma", "shape": [64], "dtype": "float32"}, {"name": "generator/decoder/up_sample_6/sequential_14/batch_normalization_13/beta", "shape": [64], "dtype": "float32"}, {"name": "generator/decoder/conv2d_transpose_7/kernel", "shape": [4, 4, 3, 128], "dtype": "float32"}, {"name": "generator/decoder/conv2d_transpose_7/bias", "shape": [3], "dtype": "float32"}, {"name": "generator/decoder/up_sample/sequential_8/batch_normalization_7/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample/sequential_8/batch_normalization_7/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_1/sequential_9/batch_normalization_8/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_1/sequential_9/batch_normalization_8/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_2/sequential_10/batch_normalization_9/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_2/sequential_10/batch_normalization_9/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_3/sequential_11/batch_normalization_10/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_3/sequential_11/batch_normalization_10/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "generator/decoder/up_sample_4/sequential_12/batch_normalization_11/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "generator/decoder/up_sample_4/sequential_12/batch_normalization_11/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "generator/decoder/up_sample_5/sequential_13/batch_normalization_12/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "generator/decoder/up_sample_5/sequential_13/batch_normalization_12/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "generator/decoder/up_sample_6/sequential_14/batch_normalization_13/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "generator/decoder/up_sample_6/sequential_14/batch_normalization_13/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "generator/encoder/down_sample/sequential/conv2d/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "generator/encoder/down_sample_1/sequential_1/conv2d_1/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "generator/encoder/down_sample_1/sequential_1/batch_normalization/gamma", "shape": [128], "dtype": "float32"}, {"name": "generator/encoder/down_sample_1/sequential_1/batch_normalization/beta", "shape": [128], "dtype": "float32"}, {"name": "generator/encoder/down_sample_2/sequential_2/conv2d_2/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "generator/encoder/down_sample_2/sequential_2/batch_normalization_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "generator/encoder/down_sample_2/sequential_2/batch_normalization_1/beta", "shape": [256], "dtype": "float32"}, {"name": "generator/encoder/down_sample_3/sequential_3/conv2d_3/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_3/sequential_3/batch_normalization_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_3/sequential_3/batch_normalization_2/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_4/sequential_4/conv2d_4/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_4/sequential_4/batch_normalization_3/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_4/sequential_4/batch_normalization_3/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_5/sequential_5/conv2d_5/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_5/sequential_5/batch_normalization_4/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_5/sequential_5/batch_normalization_4/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_6/sequential_6/conv2d_6/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_6/sequential_6/batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_6/sequential_6/batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_7/sequential_7/conv2d_7/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_7/sequential_7/batch_normalization_6/gamma", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_7/sequential_7/batch_normalization_6/beta", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_1/sequential_1/batch_normalization/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "generator/encoder/down_sample_1/sequential_1/batch_normalization/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "generator/encoder/down_sample_2/sequential_2/batch_normalization_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "generator/encoder/down_sample_2/sequential_2/batch_normalization_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "generator/encoder/down_sample_3/sequential_3/batch_normalization_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_3/sequential_3/batch_normalization_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_4/sequential_4/batch_normalization_3/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_4/sequential_4/batch_normalization_3/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_5/sequential_5/batch_normalization_4/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_5/sequential_5/batch_normalization_4/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_6/sequential_6/batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_6/sequential_6/batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_7/sequential_7/batch_normalization_6/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "generator/encoder/down_sample_7/sequential_7/batch_normalization_6/moving_variance", "shape": [512], "dtype": "float32"}]}]}